# __________________________________________Deadline_30/11/2021______________________________________________
#-------------------------------------------------Task1------------------------------------------------------
# Пользователь вводит с клавиатуры число.
# Необходимо проверить его на четность и нечетность.
# Если число четное требуется вывести на экран число и надпись Even number.
# Если число нечетное выведите на экран число и надпись Odd number.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

# while True:
#     number = int(input("Write the integer number --->>>"))
#     if number % 2 > 0 :
#         print(f'{number} - Odd number')
#     elif number == 0 :
#         print(f'{number} is not natural number')
#     elif number % 2 == 0  :
#         print(f'{number} - Even number')
#     else:
#         print("YOU ARE SHEET")
#-------------------------------------------------Task2------------------------------------------------------
# Пользователь вводит с клавиатуры число.
# Необходимо проверить его на кратность 7.
# Если число кратно требуется вывести на экран число и надпись Number is multiple 7.
# Если число не кратно выведите на экран число и надпись Number is not multiple 7.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

# while True:
#     number = int(input("Write the number --->>>"))
#     if number % 7 == 0 and not number == 0:
#         print(f'{number} - is multiple 7')
#     elif number % 7 > 0:
#         print(f'{number} - is not multiple 7')
#     elif number == 0:
#         print(f'{number} is not natural number')
#     else:
#         print("YOU ARE SHEET")
#-------------------------------------------------Task3------------------------------------------------------
# Пользователь вводит с клавиатуры два числа.
# Необходимо найти максимум из двух чисел и показать его на экран.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

# while True:
#     number_1 = int(input("Write the first number --->>>"))
#     number_2 = int(input("Write the second number --->>>"))
#
#     if number_1 != number_2:
#         if number_1 > number_2:
#                 print(f'{number_1} - is maksimum')
#         elif number_2 > number_1:
#             print(f'{number_2} - is maksimum')
#     else:
#         print("Write the different numbers!!!")
#-------------------------------------------------Task4------------------------------------------------------
# Пользователь вводит с клавиатуры два числа.
# Необходимо найти минимум из двух чисел и показать его на экран.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

# while True:
#     number_1 = int(input("Write the first number --->>>"))
#     number_2 = int(input("Write the second number --->>>"))
#
#     if number_1 != number_2:
#         if number_1 > number_2 :
#             print(f"{number_2} - is minimum")
#         elif number_2 > number_1 :
#             print(f"{number_1} - is minimum")
#     else:
#         print("Write the different numbers!!!")
#-------------------------------------------------Task5------------------------------------------------------
# Пользователь вводит с клавиатуры два числа.
# В зависимости от выбора пользователя нужно показать сумму двух чисел,
# разницу двух чисел, среднеарифметическое или произведение двух чисел.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

# number_1 = int(input("Write the first number --->>>"))
# number_2 = int(input("Write the second number --->>>"))
#
# while True:
#
#     choose_action = int(input(
#                               "\n1.Сумма двух чисел"
#                               "\n2.Разность двух чисел"
#                               "\n3.Среднее Арифметическое двух чисел"
#                               "\n4.Произведение двух чисел"
#                               "\nВыберите действие:"
#                                 ))
#     if choose_action == 1:
#         print(f"{number_1} + {number_2} = {number_1 + number_2}")
#     elif choose_action == 2:
#         if number_1 > number_2:
#             print(f"{number_1} - {number_2} = {number_1 - number_2}")
#         elif number_2 > number_1:
#             print(f"{number_2} - {number_1} = {number_2 - number_1}")
#     elif choose_action == 3:
#         print(f"({number_1} + {number_2})/2 = {(number_1+number_2)/2}")
#     elif choose_action == 4:
#         print(f"{number_1} * {number_2} = {number_2*number_1}")
#     else:
#         print("Выберите действие от 1 до 4 !!!")
#-------------------------------------------------Task6------------------------------------------------------
# Пользователь вводит с клавиатуры три числа.
# В зависимости от выбора пользователя программа выводит на экран
# сумму трёх чисел или произведение трёх чисел.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

# number_1 = int(input("Введите первое число --->>>"))
# number_2 = int(input("Введите второе число --->>>"))
# number_3 = int(input("Введите третье число --->>>"))
#
# while True:
#     action_choise = int(input("Выберите действие :"
#                               "\n1.Сумма трёх чисел "
#                               "\n2.Произведение трёх чисел"))
#
#     if action_choise == 1:
#         print(f"{number_1}  + {number_2} + {number_3} = {number_1  + number_2  + number_3}")
#     elif action_choise == 2:
#         print(f"{number_1} * {number_2} * {number_3} = {number_1 * number_2 * number_3}")
#     else:
#         print("Введите число от 1 до 2 !!!")
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# ____________________________________Deadline_05/12/2021____________________________________________________
#-------------------------------------------------Task1------------------------------------------------------
# Пользователь вводит с клавиатуры число в диапазоне от 1 до 100.
# Если число кратно 3 (делится на 3 без остатка) нужно вывести слово Fizz.
# Если число кратно 5 нужно вывести слово Buzz.
# Если число кратно 3 и 5 нужно вывести Fizz Buzz.
# Если число не кратно не 3 и 5 нужно вывести само число.
# Если пользователь ввел значение не в диапазоне от 1 до 100
# требуется вывести сообщение об ошибке.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

# while True:
#     inputer_number = int(input("Введите число в диапазоне от 1 до 100 --->>>"))
#     if inputer_number <= 100 or inputer_number >= 1 :
#         if inputer_number % 3 == 0:
#             print("Fizz")
#         elif inputer_number % 5 == 0:
#             print("Buzz")
#         elif inputer_number % 3 == 0 and inputer_number % 5 == 0:
#             print("Fizz Buzz")
#         elif not(inputer_number % 3 == 0 and inputer_number % 5 == 0):
#             print(inputer_number)
#     else:
#         print("ОШИБКА!!! Введите число в диапазоне от 1 до 100 !!!")
#-------------------------------------------------Task2------------------------------------------------------
# Зарплата менеджера составляет 200$ + процент от продаж,
# продажи до 500$ — 3%, от 500 до 1000 — 5%, свыше 1000 — 8%.
# Пользователь вводит с клавиатуры уровень продаж для трех менеджеров.
# Определить их зарплату, определить лучшего менеджера, начислить ему премию 200$,
# вывести итоги на экран. Учитывайте следущий факт,
# что все менеджеры могут иметь одинаковый уровень продаж
# - в таком случае выдайте премию в 200$ всем трём менеджерам.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

# manager1_level = int(input("Уровень продажи первого менеджера--->>>"))
# manager2_level = int(input("Уровень продажи второго менеджера--->>>"))
# manager3_level = int(input("Уровень продажи третьего менеджера--->>>"))
#
# salary1 = 0
# salary2 = 0
# salary3 = 0
#
# #Manager1
# if manager1_level >= 0 and manager1_level < 500:
#     salary1 += 200 * 0.03
# elif manager1_level >= 500 and manager1_level < 1000:
#     salary1 += 200 * 0.05
# elif manager1_level >= 1000:
#     salary1 += 200 * 0.08
#
# # Manager2
# if manager2_level >= 0 and manager2_level <= 500:
#     salary2 += 200 * 0.03
# elif manager2_level >= 500 and manager2_level < 1000:
#     salary2 += 200 * 0.05
# elif manager2_level >= 1000:
#     salary2 += 200 * 0.08
#
# # Manager3
# if manager3_level >= 0 and manager3_level <= 500:
#     salary3 += 200 * 0.03
# elif manager2_level >= 500 and manager2_level < 1000:
#     salary3 += 200 * 0.05
# elif manager2_level >= 1000:
#     salary3 += 200 * 0.08
#
#
# #SALARIS
# if salary1 > salary2 and salary1 > salary3:
#     salary1 = salary1 + 200
#
# elif salary2 > salary1 and salary2 > salary3:
#     salary2 = salary2 + 200
#
# elif salary3 > salary2 and salary3 > salary1:
#     salary3 = salary3 + 200
#
# elif salary1 == salary2 == salary3:
#     salary1 = salary1 + 200
#     salary2 = salary2 + 200
#     salary3 = salary3 + 200
#
# elif salary1 == salary2 and salary1 > salary3 and salary2 > salary3:
#     salary1 = salary1 + 200
#     salary2 = salary2 + 200
#
# elif salary1 == salary3 and salary1 > salary2 and salary3 > salary2:
#     salary1 = salary1 + 200
#     salary3 = salary3 + 200
#
# elif salary2 == salary3 and salary2 > salary1 and salary3 > salary1:
#     salary2 = salary2 + 200
#     salary3 = salary3 + 200
#
#
# print(f" manager1 - {salary1}"
#       f"\nmanager2 - {salary2}"
#       f"\nmanager3 - {salary3}")
#-------------------------------------------------Task3------------------------------------------------------
# Написать программу подсчета стоимости разговора для разных мобильных операторов.
# Мобильные операторы: Bakcell, Nar, Azercell.
# Пользователь вводит с какого на какой оператора он звонит и время в секундах.
# Требуется вычислить стоимость разговора в манатах и вывести результат на экран.
#
# Тарифы:
#
# Bakcell -> Bakcell - 0.03м
# Bakcell -> Nar - 0.05м
# Bakcell -> Azercell - 0.07м
#
# Nar -> Nar - 0.03м
# Nar -> Bakcell - 0.05м
# Nar -> Azercell - 0.06м
#
# Azercell -> Azercell - 0.03м
# Azercell -> Bakcell - 0.07м
# Azercell -> Nar - 0.06м
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# bakcell_Bakcell = 0.03
# bakcell_Nar = 0.05
# bakcell_Azercell = 0.07
#
# Nar_Nar = 0.03
# Nar_Bakcell = 0.05
# Nar_Azercell = 0.06
#
# Azercell_Azercell = 0.03
# Azercell_Bakcell = 0.07
# Azercell_Nar = 0.06
# while True:
#     seconds = int(input("Введите сколько секунд был разговор --->>>"))
#     action = int(input(
#                        "\n1)bakcell_Bakcell"
#                        "\n2)bakcell_Nar"
#                        "\n3)bakcell_Azercell"
#                        "\n4)Nar_Nar"
#                        "\n5)Nar_Bakcell"
#                        "\n6)Nar_Azercell"
#                        "\n7)Azercell_Azercell"
#                        "\n8)Azercell_Bakcell"
#                        "\n9)Azercell_Nar"
#                         "\nВыберите действие :"))
#
#     if action == 1:
#         print(f"AZN = {(((bakcell_Bakcell * seconds/60)*1000)//1)/100}")
#     if action == 2:
#         print(f"AZN = {bakcell_Nar * seconds/60}")
#     if action == 3:
#         print(f"AZN = {bakcell_Azercell * seconds/60}")
#     if action == 4:
#         print(f"AZN = {(((Nar_Nar * seconds/60)*1000)//1)/100}")
#     if action == 5:
#         print(f"AZN = {Nar_Bakcell * seconds/60}")
#     if action == 6:
#         print(f"AZN = {(((Nar_Azercell * seconds/60)*100)//1)/100}")
#     if action == 7:
#         print(f"AZN = {(((Azercell_Azercell * seconds/60)*100)//1)/100}")
#     if action == 8:
#         print(f"AZN = {Azercell_Bakcell * seconds/60}")
#     if action == 9:
#         print(f"AZN = {(((Azercell_Nar * seconds/60)*100)//1)/100}")
#     else:
#         print("Выберите действия от 1 до 9 !!!")
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# ____________________________________Deadline_09/12/2021____________________________________________________
# -------------------------------------------------Task1------------------------------------------------------
# Напишите простой калькулятор, поддерживающий следущие операции: +, -, /, *, **, %, //.
# Пользователь вводит первое число, затем операцию, а потом второе число.
# Предусмотрите и обработайте всевозможные ошибки (как ожиданные, так и неожиданные).
#
# ! Деление на ноль должно показывать знак бесконечности (∞)
# ! Неожиданные ошибки обрабатываются при помощи try except
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# while True:
#     try:
#         num1 = int(input("Введите первое число --->>>"))
#
#         option = int(input("\n1)Сложение \"1\""
#                            "\n2)Разность \"2\""
#                            "\n3)Отношение \"3\""
#                            "\n4)Произведение \"4\""
#                            "\n5)Возведение в степень \"5\""
#                            "\n6)Остаток от деления \"6\""
#                            "\n7)Целая часть от деления \"0\""
#                            "\n"
#                            "\nВыберите действие от 0 до 6:"
#                             ))
#
#         num2 = int(input("Введите Второе число --->>>"))
#
#         if option == 0:
#             print(f"{num1} // {num2} = {num1 // num2}")
#         elif option == 1:
#             print(f"{num1} + {num2} = {num1 + num2}")
#         elif option == 2:
#             print(f"{num1} - {num2} = {num1 - num2}")
#         elif option == 3:
#             print(f"{num1} / {num2} = {num1 / num2}")
#         elif option == 4:
#             print(f"{num1} * {num2} = {num1 * num2}")
#         elif option == 5:
#             print(f"{num1} ** {num2} = {num1 ** num2}")
#         elif option == 6:
#            print(f"{num1} % {num2} = {num1 % num2}")
#
#     except ArithmeticError:
#         print("∞")
#     except ValueError as message:
#         print("Введите число !!!", message)
#-------------------------------------------------Task2------------------------------------------------------
# Пользователь вводит с клавиатуры целое шестизначное число.
# Написать программу, которая определяет, является ли введенное число — счастливым
# (Счастливым считается шестизначное число, у которого сумма первых 3 цифр равна сумме вторых трех цифр).
# Например, 123321 — счастливое число, так как 1 + 2 + 3 == 3 + 2 + 1.
# С другой стороны 378423 несчастливое число, так как 3 + 7 + 8 != 4 + 2 + 3.
# Если пользователь ввел не шестизначное число или не число требуется вывести сообщение об ошибке.
#
# ! Неожиданные ошибки обрабатываются при помощи try except
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

# while True:
#     try:
#         number_6 = int(input("Введите шестизначное число --->>> "))
#         if number_6 >=100000:
#             if number_6 <= 999999:
#                 num1 = number_6 // 100000
#                 num2 = (number_6 % 100000) // 10000
#                 num3 = (number_6 % 10000) // 1000
#                 num4 = (number_6 % 1000)//100
#                 num5 = (number_6 % 100)//10
#                 num6 = number_6 % 10
#
#                 if num1 + num2 + num3 == num4 + num5 + num6:
#                     print("Lucky number :) !!!")
#                 else:
#                     print("unlucky number :( !!!")
#             else:
#                 print("ОШИБКА!!!ОШИБКА!!!ОШИБКА!!! Введите шестизначное число !!! ")
#         else:
#             print("ОШИБКА!!!ОШИБКА!!!ОШИБКА!!! Введите шестизначное число !!! ")
#     except ValueError as message :
#         print("ОШИБКА!!!ОШИБКА!!!ОШИБКА!!! ПВведите числа ,не буквы !!!","\n", message)
#-------------------------------------------------Task3------------------------------------------------------
# Пользователь вводит с клавиатуры номер месяца (от 1 до 12).
# В зависимости от полученного номера месяца программа выводит на экран надпись:
# Winter (если введено значение 1,2 или 12), Spring (если введено значение от 3 до 5),
# Summer (если введено значение от 6 до 8), Autumn (если введено значение от 9 до 11).
#
# Если пользователь ввел значение не в диапазоне от 1 до 12 требуется вывести сообщение об ошибке.
# Также предусмотрите ту ситуацию когда пользователь вводит вовсе не число.
#
# ! Неожиданные ошибки обрабатываются при помощи try except
## ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

# try:
#     month = int(input(         "\n1)January "
#                                "\n2)February "
#                                "\n3)Marth "
#                                "\n4)Aprel "
#                                "\n5)May "
#                                "\n6)June "
#                                "\n7)July "
#                                "\n8)August "
#                                "\n9)September "
#                                "\n10)October "
#                                "\n11)November "
#                                "\n12)December "
#                                "\n"
#                                "\nВведите номер месяца от 1 до 12:"))
#
#     if month == 1 or month == 2 or month == 12 :
#         print("Winter")
#
#     elif month == 3 or month == 4 or month == 5:
#         print("Spring")
#
#     elif month == 6 or month == 7 or month == 8:
#         print("Summer")
#
#     elif month == 9 or month == 10 or month == 11:
#         print("Autumn")
#     else:
#         print("Write the number in [1,12] !!!")
# except ValueError as message:
#     print("Write the number!!!",message)
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# _________________________________________Deadline_12/12/2021________________________________________________
# -------------------------------------------------Task1------------------------------------------------------
# Пользователь вводит с клавиатуры два числа (начало и конец диапазона).
# Требуется проанализировать все числа в этом диапазоне.
# Нужно вывести на экран:
# 	- Все числа диапазона;
# 	- Все числа диапазона в убывающем порядке;
# 	- Все числа, кратные 7;
# 	- Количество чисел, кратных 5.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

##(1)--------------------------------------
# start = int(input("Введите первое число --->>>"))
# end = int(input("Введите последнее число --->>>"))
# while start <= end :
#     print(start)
#     start += 1

##(2)--------------------------------------
# start = int(input("Введите первое число --->>>"))
# end = int(input("Введите последнее число --->>>"))
# while end >= start :
#     print(end)
#     end -= 1

##(3)--------------------------------------
# start = int(input("Введите первое число --->>>"))
# end = int(input("Введите последнее число --->>>"))
# while start <= end :
#     if start % 7 == 0:
#         print(start)
#     start += 1

##(4)--------------------------------------
# start = int(input("Введите первое число --->>>"))
# end = int(input("Введите последнее число --->>>"))
# i = 0
# while start <= end :
#     if start % 5 == 0:
#         print(start)
#         i += 1
#     start += 1
# print("Количество чисел кратных 7 -- >>>",i)
# -------------------------------------------------Task2------------------------------------------------------
# Пользователь вводит с клавиатуры два числа.
# Нужно показать все нечетные числа в указанном диапазоне.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# number1 = int(input("Введите первое число  --->>>"))
# number2 = int(input("Введите второе число  --->>>"))
# i = 0
# while number1 <= number2:
#     if number1 % 2 > 0:
#         print(number1)
#         i += 1
#     number1 += 1
# print("Количество нечётных чисел --->>> ",i)
# -------------------------------------------------Task3------------------------------------------------------
# Пользователь вводит с клавиатуры два числа.
# Нужно показать все четные числа в указанном диапазоне.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# number1 = int(input("Введите первое число  --->>>"))
# number2 = int(input("Введите второе число  --->>>"))
# i = 0
# while number1 <= number2:
#     if number1 % 2 == 0:
#         i += 1
#         print(number1)
#     number1 += 1
# print("Количество четных чисел --->>>",i)
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# _________________________________________Deadline_14/12/2021________________________________________________
# ------------------------------------------------Task1-------------------------------------------------------
# Пользователь вводит с клавиатуры числа.
# Требуется найти сумму всех введённых пользователем чисел.
# Ввод прекращается когда пользователь вводит 0.
#
# ! Пользователь может ввести с клавиатуры как 5 чисел, так и 20, или 40, или 17...

# b = 0
# while True:
#     try:
#         a = int(input("Введите число --->>> "))
#         if a == 0:
#             print("done")
#             break
#         else:
#             b += a
#     except ValueError as message:
#         print("ОШИБКА!!!ОШИБКА!!!ОШИБКА!!!Введите число!!! ""\n",message)
# print("Сумма = ",b)
# ------------------------------------------------Task2-------------------------------------------------------
# Пользователь вводит с клавиатуры числа.
# Выведите на экран только те числа, которые:
# - Кратны 3;
# - Находятся в диапазоне от 1 до 30 (включительно);
#
# Ввод прекращается когда пользователь вводит 0.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# while True:
#     try:
#         number = int(input("Введите число --->>> "))
#         if number % 3 == 0:
#             print(number)
#         if number in (3,30):
#             print(number)
#         else:
#             print("ОШИБКА!!!ОШИБКА!!!ОШИБКА!!! В диапазоне от 1 до 30!!!")
#         if number == 0:
#             print("Done")
#             break
#     except ValueError as message:
#         print("ОШИБКА!!!ОШИБКА!!!ОШИБКА!!!Введите число!!!""\n",message)
# ------------------------------------------------@Task2*-------------------------------------------------------
# - Заместо ввода 0, сделайте так, чтобы ввод прекращался при вводе слова exit или stop.
#
# ! Пользователь вводит ровно столько чисел, сколько он захочет.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# while True:
#     try:
#         number = int(input(
#                            "\nЧтобы выйти из программы введите \"0\" ,\"exit\",\"stop\" "
#                            "\nВведите число --->>> " ))
#
#         if number % 3 == 0 and number in (3,30):
#             print(number)
#         elif number >= 30 or number < 3:
#             print("ОШИБКА!!!ОШИБКА!!!ОШИБКА!!! В диапазоне от 1 до 30!!!")
#         if number == "exit" or number == "stop":
#             print("Done")
#             break
#     except ValueError as message:
#         print("ОШИБКА!!!ОШИБКА!!!ОШИБКА!!!Введите число!!!""\n",message)
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

# ---------------------------------------------------------------------------------------------------------------------
# ---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---
# ---------------------------------------------------------------------------------------------------------------------
# -------------------------------------------------------Task3----------------------------------------------------------
# Напишите игру "Угадай число".
# Пользователь пытается угадать загаданное компьютером число в диапазоне от 1 до 100.
# Если пользователь промахивается, то компьютер подсказывает ему: горячо или холодно.
# Предусмотрите:
# 	- Случайная генерация числа;
# 	- Кол-во потребовавшихся попыток для угадывания числа;
# 	- Выход из игры при вводе 0;
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# from random import randint
# try:
#     count = int(input("--------------------------------------"
#                       "\nИгра \"Угадай число\" "
#                           "\nПользователь пытается угадать загаданное компьютером число в диапазоне от 1 до 100"
#                           "\nЧтобы выйти из игры введите - \'0\'"
#                       "\n"
#                           "\nКоличество попыток --->>> "))
# except ValueError as message :
#     print("----------------------------"
#           "\nТы ДУРАК !!! "
#           "\nВведи нормальное число !!!"
#           "\n", message)
#
#
# random_number = randint(1,100)
# counter = 0
# while True:
#     try:
#         person = int(input("\n--------------------------------------"
#                            "\nЧтобы выйти из игры введите - \'0\'"
#                            "\nУгадай число --->>>  "))
#         difference = random_number - person
#         if difference < 0 :
#             difference = difference * (-1)
#
#
#         if difference == 0:
#             print("\nCOOL BOY !!! "
#                   "\nЗа сколько попыток вы угадали рандомное число", counter+1)
#             counter += 1
#             break
#         elif difference <= 3:
#             print("\nHELL")
#             counter += 1
#         elif difference <= 6:
#             print("\nYOU ARE HOTDOG")
#             counter += 1
#         elif difference <= 12:
#             print("\nmore hot")
#             counter += 1
#         elif difference <= 20:
#             print("\nNorm")
#             counter += 1
#         elif difference <= 30:
#             print("\nCold")
#             counter += 1
#         elif difference >= 50:
#             print("\nICE")
#             counter += 1
#         if person == 0:
#             break
#         if counter == count:
#             print("\nКоличество попыток закончилось !!! ВЫ ПРОИГРАЛИ !!! НЕУДАЧНИК !!! ЛОШАРА!!!!")
#             break
#         print("random number", random_number)
#         print("difference", difference)
#     except ValueError as message :
#         print("\nТы ДУРАК !!! "
#               "\nВведи нормальное число !!!"
#               "\n",message)
#-------------------------------------------------------@Task3*-----------------------------------------------------------
# - Предусмотрите возможность ввода пользователем диапазона генерации случайного числа.
# Например, пользователь может ввести диапазон от 1 до 1000 и компьютер сгенерирует число в этом диапазоне.
# Предусмотрите случай неправильного ввода диапазона. Например от 1000 до 1;
# - Добавьте 3 уровня сложности и возможность выбора их пользователем.
# Каждый уровень сложности ограничивает количество попыток ввести число.
# Например, на сложном уровне пользователю даётся всего 10 попыток угадать число, но и подсказки должны быть лучше.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

# ---------------------------------------------------------------------------------------------------------------------
# ---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---
# ---------------------------------------------------------------------------------------------------------------------
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# # _________________________________________Deadline_19/12/2021________________________________________________
# # ------------------------------------------------Task1-------------------------------------------------------
# (1)-----------------------------------------------------------------------------------------------------------
# Выведите на экран следущие фигурки используя вложенные циклы:
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# a = 0
# while a < 5:
#     b = 0
#     while b < 5:
#         if a == 0 or b == 4:
#             print("* ", end = " ")    #                                * * * * *
#         elif a == 4 or b == 0:        #                                *       *
#             print("* ", end=" ")      #                                *       *
#         else:                         #                                *       *
#             print("  ", end=" ")      #                                * * * * *
#         b += 1
#     a += 1
#     print()

# (*1)---------------------------------------------
# Пользователь вводит стороны квадрато с клавиатуры :
# a = 0
# num1 = int(input("Введите сторону(высоту) квадрата --->>>"))
# num2 = int(input("Введите сторону квадрата --->>>"))
# while a < num1:
#     b = 0
#     while b < num2 :
#         if a == 0 or b == (num2 - 1):
#             print("* ", end = " ")
#         elif a == (num1 - 1) or b == 0:
#             print("* ", end=" ")
#         else:
#             print("  ", end=" ")
#         b += 1
#     a += 1
#     print()

#(2)--------------------------------------------------------------------------------------------------------------------
# height = 0
# while height < 3:
#     side = 0
#     while side < 7:
#         if height == 0 or side == 6 :       #        * * * * * * *
#             print("* ", end = " ")          #        *           *
#         elif height == 2 or side == 0:      #        * * * * * * *
#             print("* ", end =" ")
#         else:
#             print("  ", end = " ")
#         side += 1
#     height += 1
#     print()

#(3)--------------------------------------------------------------------------------------------------------------------
# height = 0
# while height < 7:
#     side = 0
#     while side < 3:
#         if height == 6 or side == 0:     #    * * *
#             print("* ", end = " ")       #    *   *
#         elif height == 0 or side == 2:   #    *   *
#             print("* ", end = " ")       #    *   *
#         else:                            #    *   *
#             print("  ", end = " ")       #    *   *
#         side += 1                        #    * * *
#     print()
#     height += 1
#(4)-----------------------------------------------------LEVEL HELL-----------------------------------------------------
#-----------------------------------------------------------------------------------------------------------------------
#:::::::::::::::::::::::::::::::::::::::::::(ПЕРВЫЙ ТРЕУГОЛЬНИК КОТОРЫЙ ВЕРХ НОГАМИ СТОИТ)::::::::::::::::::::::::::::::
# i = 0
# height = 7
# while i < height:                               #     * * * * * *
#     space = i                                   #      * * * * *
#     while space > 0:                            #       * * * *
#         print(end = " ")                        #        * * *
#         space -= 1                              #         * *
#     stars =  height - i - 1                     #          *
#     while stars > 0:
#         print("*", end = " ")
#         stars -= 1
#     i += 1
#     print()
#
#
# # -----------------------------(ВТОРОЙ ТРЕУГОЛЬНИК КОТОРЫЙ ПРАВИЛЬНО СТОИТ ):::::::::::::
#
# height = 6
# i = 0
# while i < height:
#     space = height - i - 1
#     while space> 0:                                              #          *
#         print(end = " ")                                         #         * *
#         space -= 1                                               #        * * *
#     stars = height - 5 + i        # or stars + i + 1             #       * * * *
#                                                                  #      * * * * *
#     while stars > 0 :                                            #     * * * * * *
#         print("*", end = " ")
#         stars -= 1
#
#     i += 1
#     print()

# -----------------------------( ПЕРВЫЙ ТРЕУГОЛЬНИК КОТОРЫЙ ПРАВИЛЬНО СТОИТ ВВОД С КЛАВИАТУРЫ):::::::::::::
# i = 0
# height2 = int(input(" Triangle^s height --- >>>"))
# height = height2
# height += 1
# while i < height:
#     space = i                                    #     * * * * * *
#     while space > 0:                             #      * * * * *
#         print(end = " ")                         #       * * * *
#         space -= 1                               #        * * *
#     stars =  height - i - 1                      #         * *
#     while stars > 0:                             #          *
#         print("*", end = " ")
#         stars -= 1
#     i += 1
#     print()
#
# # -----------------------------(ВТОРОЙ ТРЕУГОЛЬНИК КОТОРЫЙ ПРАВИЛЬНО СТОИТ И ВВОДИТЬСЯ С КЛАВИАТУРЫ):::::::::::::
# height1 = height2
# i = 0
# while i < height1:
#     space = height1 - i - 1
#     while space > 0:                                 #          *
#         print(end = " ")                             #         * *
#         space -= 1                                   #        * * *
#     stars = i + 1                                    #       * * * *
#                                                      #      * * * * *
#     while stars > 0 :
#         print("*", end = " ")
#         stars -= 1
#
#     i += 1
#     print()
# ------------------------------------------------(РОМБ)::::::::::::::::::::::::::::::::::::::
# height = 6
# i = 0
# while i < height:
#     space = height - i - 1
#     while space> 0:
#         print(end = " ")
#         space -= 1
#     stars = height - 5 + i        # or stars + i + 1
#
#     while stars > 0 :                          #          *
#         print("*", end = " ")                  #         * *
#         stars -= 1                             #        * * *
#                                                #       * * * *
#     i += 1                                     #      * * * * *
#     print()                                    #     * * * * * *
# i = 0                                          #     * * * * * *
# height = 7                                     #      * * * * *
# while i < height:                              #       * * * *
#     space = i                                  #        * * *
#     while space > 0:                           #         * *
#         print(end = " ")                       #          *
#         space -= 1
#     stars =  height - i - 1
#     while stars > 0:
#         print("*", end = " ")
#         stars -= 1
#     i += 1
#     print()
# ------------------------------------------------(РОМБ ВВОДИТЬСЯ С КЛАВИАТУРЫ)::::::::::::::::::::::::::::::::::::::
# height1 = int(input(" Diamond^s height --->>>"))
# height = height1
# i = 0
# while i < height:
#     space = height - i - 1
#     while space > 0:
#         print(end=" ")
#         space -= 1
#     stars = height - 9 + i  # or stars + i + 1
#                                                        #          *
#     while stars > 0:                                   #         * *
#         print("*", end=" ")                            #        * * *
#         stars -= 1                                     #       * * * *
#         #                                              #      * * * * *
#     i += 1                                             #     * * * * * *
#     print()                                            #     * * * * * *
#                                                        #      * * * * *
# i = 0                                                  #       * * * *
# height = height1 + 1                                   #        * * *
# while i < height:                                      #         * *
#     space = i                                          #          *
#     while space > 0:
#         print(end=" ")
#         space -= 1
#     stars = height - i - 1
#     while stars > 0:
#         print("*", end=" ")
#         stars -= 1
#     i += 1
#     print()

#(5)-----------------------------------------------------LEVEL HELL-----------------------------------------------------
#-----------------------------------------------------------------------------------------------------------------------
#:::::::::::::::::::::::::::::::::::::::::::(ПЕРВЫЙ ТРЕУГОЛЬНИК КОТОРЫЙ ВЕРХ НОГАМИ СТОИТ)::::::::::::::::::::::::::::::
#-------------------------------------------------------- @Task1*-------------------------------------------------------
# Распечатайте данную фигуру используя только один вложенный цикл в другой.
#
#           * * * * * *
#            * * * * *
#             * * * *
#              * * *
#               * *
#                *
#               * *
#              * * *
#             * * * *
#            * * * * *
#           * * * * * *
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::

# ---------------------------------------------------------------------------------------------------------------------
# ---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---НЕ ПОЛУЧИЛОСЬ!!!---
# ---------------------------------------------------------------------------------------------------------------------

# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# ______________________________________________Deadline_21/12/2021________________________________________________
#----------------------------------------------------- @Task1------------------------------------------------------
# - Показать на экран таблицу умножения в диапазоне, указанном пользователем.
# Например, если пользователь указал 3 и 5, таблица будет выглядеть примерно так:
#
# 3 * 1 = 3
# 3 * 2 = 6
# 3 * 3 = 9
# ...
# 3 * 10 = 30
# ...........
# 5 * 1 = 5
# 5 * 2 = 10
# 5 * 3 = 15
# ...
# 5 * 10 = 50
#
# ! Обязательно используйте цикл for для решения задачи.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# number_1 = int(input("Введите первый множитель диапазона --->>>"))
# number_2 = int(input("Введите второй множитель диапазона --->>>"))
#
# for i in range(number_1,number_2 + 1):
#     for j in range(1,10 + 1):
#         print(f"{i} * {j} = {j * i}")
#     print("_"*10)

#------------------------------------------------------- @Task1*--------------------------------------------------------
# - Теперь пользователь может выбрать диапазон и для множителя. Т.е:
#
# 3 * 9 = 27
# 3 * 10 = 30
# 3 * 11 = 33
# ...
# 3 * 30 = 90
# ...........
# 5 * 9 = 45
# 5 * 10 = 50
# 5 * 11 = 55
# ...
# 5 * 30 = 150
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# number_1 = int(input("Введите первое число диапазона --->>>"))
# number_2 = int(input("Введите второе число диапазона --->>>"))
# number_11 = int(input("Введите первое число диапазона для множителя--->>>"))
# number_22 = int(input("Введите второе число диапазона для множителя--->>>"))
# for i in range(number_1,number_2 + 1):
#     for j in range(number_11,number_22 + 1):
#         print(f"{i} * {j} = {j * i}")
#     print("_"*10)

#----------------------------------------------------------- @Task2-----------------------------------------------------
# - Показать на экран все простые числа в диапазоне, указанном пользователем.
# Число называется простым, если оно делится без остатка только на себя и на единицу.
# Например, три — это простое число, а четыре нет.
#
# ! Обязательно используйте цикл for для решения задачи.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# while True:
#     number_1 = int(input("Введите первое число диапазона --->>>"))
#     number_2 = int(input("Введите второе число диапазона --->>>"))
#     for i in range(number_1,number_2 + 1):
#         if i != 1 and i != 2 :
#             flag = True
#
#
#             for j in range(2,i):
#                 if i % j == 0:
#                     flag = False
#                     break
#
#             if flag :
#                 print(i , end = " ")
#     print("\n")
# ----------------------------------------------------@Task3*----------------------------------------------------------
# - Пользователь вводит длину и ширину прямоугольника.
# Выведите на экран незаполненный прямоугольник (или квадрат, в случае если ширина и длина равны).
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# a = int(input("Side  --->>>"))
# b = int(input("Height--->>>"))
# for height in range (b):
#     for side in range(a):
#         if height == 0 or side == a - 1:
#             print("*", end = " ")
#         elif height == b - 1 or side == 0:
#             print("*", end=" ")
#         else:
#             print(" ",end=" ")
#     print()

# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# ______________________________________________Deadline_26/12/2021________________________________________________
# -----------------------------------------------------@Task1------------------------------------------------------
# В списке из целых случайных чисел вычислить:
#  - Сумму отрицательных чисел;
#  - Сумму четных чисел;
#  - Сумму нечетных чисел;
#  - Произведение элементов с индексами кратными 3;
#  - Сумму элементов, находящихся между первым и последним положительными элементами;
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# print("--TASK1--"*15)
# from random import randint
# random_list = [randint(-100,100) for _ in range(12)]
# print("random_list",random_list)
# #---------------------------------------- Sum of negative numbers
# negative_numbers = [item for item in random_list if item < 0]
# print("\nList of negative numbers :",negative_numbers)
# i = 0
# for item in negative_numbers:
#     i += item
# print("Sum of negative numbers --->>>",i)
#
# #---------------------------------------- Sum of positive numbers
# positive_numbers = [item for item in random_list if item > 0]
# print("\nList of positive numbers :",positive_numbers)
# i = 0
# for item in positive_numbers:
#     i += item
# print("Sum of positive numbers --->>>",i)
#
# #-------------------------------------- Sum of (Нечётные)odd numbers
# odd_numbers = [item for item in random_list if not (item % 2 == 0)]
# print("\nList of odd numbers :",odd_numbers)
# i = 0
# for item in odd_numbers:
#     i += item
# print("Sum of odd numbers --->>>",i)
#
# #-------------------------------------- Sum of (Чётные)even numbers
# even_numbers = [item for item in random_list if item % 2 == 0]
# print("\nList of even numbers :",even_numbers)
# i = 0
# for item in even_numbers:
#     i += item
# print("Sum of even numbers --->>>",i)
#
# #------------------------------------ Произведение элементов с индексами кратными 3
# # В списке из целых случайных чисел вычислить:
# # Произведение элементов с индексами кратными 3
# #
# # Создал список рандомных чисел
# print("Создал список рандомных чисел :",random_list)
# #
# # #Список индексов
# index = [i for i in range(len(random_list)) ]
# print("Список индексов :",index)
#
# # Список индексов кратных 3
# index_3 = [i for i in index if i % 3 == 0]
# print("Список индексов котрые кратны 3:",index_3)
#
# # Получить значения индексов кратных 3
# multiplication = 1  # Переменная для умножения значений индексов кратных 3
#
# for i in index_3: # i = 0 3 6 9 ... .
#     print(f"\"{i}\" Индексу пренадлежит число", end = " --- >>> ")
#     print(random_list[i])
#
#     multiplication *= random_list[i]
#
# print("\nПроизведение --->>> ", multiplication)
#
# # ----------------------------------- Сумму элементов, находящихся между первым и последним положительными элементами:
# positive_numbers = [item for item in random_list if item > 0]
# print("\nList of positive numbers :",positive_numbers)
#
# print("Первый положительный элемент --->>> ",positive_numbers[0])
# print("Последний положительный элемент --->>>",positive_numbers[len(positive_numbers) - 1 ])
#
# # Создаю новый список в котором находятся числа между минимальным и максимальным элементом
# new_list = [i for i in range(positive_numbers[0],positive_numbers[len(positive_numbers) - 1 ])]
# print("элементы находящиеся между первым и последним положительными элементами --->>>",new_list)
#
# # Создаю переменную sum чтобы посчитать произведение чисел между макс и мин числом
# sum = 0
#
# for j in new_list:
#     sum += j
#
# print("\nСуммa элементов, находящихся между первым и последним положительными элементами --->>>",sum )
#
# # ----------------------------------------------------(***@Task1***)------------------------------------------------
# #  - Произведение элементов между минимальным и максимальным элементом.
# # ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# print("\n"*5)
# print("--TASK1***--"*15)
# from random import randint
# # Создал список рандомных чисел
# random_list = [randint(1,10) for _ in range(10)]
# print("Создал список рандомных чисел :",random_list)
#
# # Ищю максимальное число из списке
# max = random_list[0]
# for i in range(len(random_list)):
#     if random_list[i] > max :
#         max = random_list[i]
# print("max number of list ",max)
#
# # Ищю минимальное число из списке
# min = random_list[0]
# for i in range(len(random_list)):
#     if random_list[i] < min :
#         min = random_list[i]
# print("min number of list ",min)
#
# # Создаю новый список в котором находятся числа между минимальным и максимальным элементом
# new_list = [i for i in range(min,max)]
# print(new_list)
#
# # Создаю переменную multiplication1 чтобы посчитать произведение чисел между макс и мин числом
# multiplication1 = 1
#
# for j in new_list:
#     multiplication1 *= j
#
# print("Произведение элементов между минимальным и максимальным элементом --->>> ",multiplication1)
#
# # ---------------------------------------------------------@Task2---------------------------------------------------
# # Есть список целых случайных чисел. Требуется:
# #
# #  - Создать список целых, содержащий только четные числа из первого списка;
# #  - Создать список целых, содержащий только нечетные числа из первого списка;
# #  - Создать список целых, содержащий только отрицательные числа из первого списка;
# #  - Создать список целых, содержащий только положительные числа из первого списка.
# #
# # ! Использование методов списка под запретом.
# # ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# print("\n"*5)
# print("--TASK2--"*15)
# from random import randint
# # Создал список рандомных чисел
# random_list = [randint(-10,10) for _ in range(10)]
# print("\nСоздал список рандомных чисел :",random_list)
#
# # Создать список целых, содержащий только четные числа из первого списка
# even_list = [i for i in random_list if i % 2 == 0]
# print("even_list --->>> ",even_list)
# # Создать список целых, содержащий только нечетные числа из первого списка
# Odd_list = [i for i in random_list if i % 2 != 0]
# print("Odd list --->>> ",Odd_list)
# # Создать список целых, содержащий только отрицательные числа из первого списка
# negative_list = [i for i in random_list if i < 0 ]
# print("negative list--->>> ",negative_list)
# # Создать список целых, содержащий только положительные числа из первого списка
# positive_list = [i for i in random_list if i > 0 ]
# print("positive list --->>> ",positive_list)

# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# # ______________________________________________Deadline_29/12/2021________________________________________________
# # --------------------------------------------------------@Task1---------------------------------------------------
# # Два списка целых заполняются случайными числами.
# # Нужно:
# #  - Сформировать третий список, содержащий элементы обоих списков;
# #
# # ! Использовать оператор + и метод .extend на двух списках запрещено.
# #
# #  - Сформировать третий список, содержащий элементы обоих списков без повторений;
# #  - Сформировать третий список, содержащий элементы общие для двух списков;
# #  - Сформировать третий список, содержащий только уникальные элементы каждого из списков;
# #  - Сформировать третий список, содержащий только минимальное и максимальное значение каждого из списков.
# #
# # ! Использование min/max под запретом.
# #
# # ! Пример:
# # list1 = [1, 2, 2, 3, 4]
# # list2 = [3, 5, 2, 5, 6]
# # [1, 2, 2, 3, 4, 3, 5, 2, 5, 6] - элементы обоих списков;
# # [1, 2, 3, 4, 5, 6] - элементы обоих списков без повторений;
# # [2, 3] - элементы общие для двух списков;
# # [1, 3, 4, 3, 2, 6] - уникальные элементы каждого из списков;
# # [1, 4, 2, 6] - минимальное и максимальное значение каждого из списков.
# # ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# print("--TASK1--"*15)
# # Сформировать третий список, содержащий элементы обоих списков без повторений
# from random import randint
# #   Create random list1 and list2:
# list1 = [randint(-5,5) for _ in range(10)]
# list2 = [randint(-5,5) for _ in range(10)]
# print("list1:", list1)
# print("list2:", list2)
# list3 = []
# for i in list1:
#     if i not in list3:
#         list3.append(i)
# for i in list2:
#     if i not in list3:
#         list3.append(i)
# print("Элементы обоих списков без повторений:",list3)
# print("\n-----<next>"*10)
#
# # Сформировать третий список, содержащий элементы общие для двух списков
# from random import randint
# #   Create random list1 and list2:
# list1 = [randint(-5,5) for _ in range(10)]
# list2 = [randint(-5,5) for _ in range(10)]
# print("list1:", list1)
# print("list2:", list2)
# list4 = []
# for i in list1:
#     if i in list2 and i not in list4:
#         list4.append(i)
# print("Элементы общие для двух списков:",list4)
#
#
# # Сформировать третий список, содержащий только уникальные элементы каждого из списков
# # (уникальные элементы это элементы которые не повторяются в списке)
# print("\n-----<next>"*10)
# from random import randint
#   # Create random list1 and list2:
# list1 = [randint(-5,5) for _ in range(6)]
# list2 = [randint(-5,5) for _ in range(6)]
# print("list1: ",list1)
# # print("list1: ",list1.count(1))
# print("list2: ", list2)
# list5 = []
# for i in list1:
#     if list1.count(i) < 2 :
#         list5.append(i)
# for j in list2:
#     if list2.count(j) < 2 :
#         list5.append(j)
# print("Yникальные элементы каждого из списков: ",list5)
# print("-----<next>"*10)
#
#
# # Сформировать третий список, содержащий только
# # минимальное и максимальное значение каждого из списков
# from random import randint
# list1 = [randint(-5,5) for i in range(4)]
# list2 = [randint(-5,5) for j in range(4)]
# print("list1 : ",list1)
# print("list2 : ",list2)
#
# # max and min values of list1
# max1 = 0
# for i in range(len(list1)):
#     if list1[i] > max1:
#         max1 = list1[i]
# print("max value of list1:", max1)
# min1 = 0
# for i in range(len(list1)):
#     if list1[i] < min1:
#         min1 = list1[i]
# print("min value of list1:", min1)
#
# # max and min values of list2
# max2 = 0
# for i in range(len(list2)):
#     if list2[i] > max2:
#         max2 = list2[i]
# print("max value of list2:", max2)
# min2 = 0
# for i in range(len(list2)):
#     if list2[i] < min2:
#         min2 = list2[i]
# print("min value of list2 :", min2)
#
# list3 = []
# list3.append(min1)
# list3.append(max1)
# list3.append(min2)
# list3.append(max2)
# print("list3 VARIANT - A: ",list3)
# # #   <VARIANT-B>    <VARIANT-B>    <VARIANT-B>    <VARIANT-B>    <VARIANT-B>    <VARIANT-B>
# # #  OR    ||
# # #        ||
# # #       \\//
# # #        \/
# #
# # list1.sort()
# # # print(list1)
# #
# # list2.sort()
# # # print(list2)
# #
# # del list1[1:len(list1)-1]
# # del list2[1:len(list2)-1]
# # list_of_max_min = list1 + list2
# # print("list3 VARIANT - B:" ,list_of_max_min)

# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# ______________________________________________Deadline_09/01/2021________________________________________________
# --------------------------------------------------------@Task1---------------------------------------------------
# Пользователь вводит с клавиатуры строку. Посчитайте количество букв, цифр в строке. Выведите оба количества на экран.
#
# ! Для определения символ это или цифра - используйте методы isalpha и isdigit соответственно.
#________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# person = input("Введите строку сожержащую как буквы так и цифры --->>>")
# letter_count = 0
# num_count = 0
# # strings
# for i in person:
#     if i.isalpha():
#         letter_count += 1
# # numbers
# for i in person:
#     if i.isdigit():
#         num_count += 1
# print(f"Letter count : {letter_count}")
# print(f"Number count : {num_count}")

# --------------------------------------------------------@Task2---------------------------------------------------
# Пользователь вводит с клавиатуры строку. Найдите все цифры внутри строки, просуммируйте их и выведите на экран.
#
# ! Например: Привет!1 Как дела?7. Результат: 8
#
#________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# person = input("Write strig --->>> ")
# sum = 0
# for i in person:
#     if i.isdigit():
#         sum += int(i)
# print(f'Sum: {sum}')

# --------------------------------------------------------@Task3---------------------------------------------------
# Пользователь вводит с клавиатуры слово. Проверьте является  ли  введенное слово палиндромом.
# Палиндром - слово или текст, которое читается одинаково слева направо и справа налево.
# Например: ротатор, радар, шалаш, шиш, доход.
#
# ! Выражение [::-1] в любой форме под запретом. Её использование не засчитает задание сделанным.
# ! Предполагается, что пользователь будет вводить строку с маленькой буквы. Т.е регистр букв не стоит учитывать.
#
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# person = input("Write word! --->>>")
# empty = ''
# lenght = len(person)
# lenght *= -1
# a = -1
#
# while a != lenght - 1:
#     empty += person[a]
#     a -= 1
# print(empty)
#
# if empty == person:
#     print(f'The word "{person}" is palidrom')
# else:
#     print(f'The word "{person}" is not palidrom')

# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# ______________________________________________Deadline_09/01/2021________________________________________________
# --------------------------------------------------------@Task1---------------------------------------------------
# Пользователь вводит с клавиатуры арифметическое выражение в формате строки.
# Необходимо вывести на экран результат выражения.
# Арифметическое выражение может состоять только из трёх частей: число, операция, число.
# Например, пользователь вводит строку "13+19".
# Программа должна вывести результат сложения, т.е 32.
#
# Возможные операции: +, -, *, /
#
# ! eval под запретом. Для решения задачи нужно использовать пройденные методы строк / списков.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# person = input("Введите арифметическое выражение --->>> ")
# if '+' in person:
#     a, b = person.split('+')
#     print(int(a) + int(b))
# elif '-' in person:
#     a,b = person.split("-")
#     print(int(a) - int(b))
# elif '*' in person:
#     a,b = person.split("*")
#     print(int(a) * int(b))
# elif '/' in person:
#     a,b = person.split("/")
#     print(int(a) / int(b))
# else:
#     print("You entered something wrong ")

# -------------------------------------------------------@Task1*---------------------------------------------------
# Теперь арифметическое выражение может состоять из N-го количества операций. Например: 6 / 2 + 5 * 3 - 1 = 17
#
# ! Учитывайте приоритет операций. Умножение и деление должно выполнятся первым.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# Easy method:
# s=input("Enter an example: ")
# print(eval(s))
# NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED

# --------------------------------------------------------@Task2---------------------------------------------------
# Мат-фильтр. Пользователь вводит с клавиатуры запрещёные слова, а затем сам текст.
# Замените все найденные слова в тексте на звёздочку.
# При замене не учитывайте регистр строки, т.е слово снег и сНеГ для программы должны быть одним и тем же.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::



# --------------------------------------------------------@Task2*---------------------------------------------------
# Отобразите статистику по количеству заменённых слов.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED
# NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED
# NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED

# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# ИЗИ
# ______________________________________________Deadline_16/01/2021________________________________________________
# ----------------------------------------------------@Task1-------------------------------------------------------
# Напишите функцию is_even, проверяет, является ли число чётным.
# Функция должна возвращать bool.
## ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# number = int(input("Is even the number ?  --->>>"))
# flag = False
# def is_even(number):
#     if number % 2 == 0:
#         flag = True
#         print(flag)
#     else:
#         flag = True
#         print(not flag)
#
# is_even(number)

# ----------------------------------------------------@Task2----------------------------------------------------
# Напишите функцию is_odd, которая проверяет, является ли число НЕчётным.
# Функция должна возвращать bool.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# number = int(input("Is odd the number ? --->>>"))
# def is_odd(number):
#     if number % 2 != 0:
#         flag = True
#         print(flag)
#     else:
#         flag = True
#         print( not flag)
#
# is_odd(number)

# ----------------------------------------------------@Task2*----------------------------------------------------
# Реализуйте функцию таким способом, чтобы она не делала никаких сравнений или вычислений,
# но при этом давала прежний результат.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# s = input("Enter an example: ")
# def solve(s):
#     print(eval(s))
# solve(s)

# ----------------------------------------------------@Task3----------------------------------------------------
# Напишите функцию is_negative, которая проверяет, является ли число отрицательным.
# Функция должна возвращать bool.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# number = int(input("Is negative? --->>>"))
# def is_negative(number):
#     if number < 0:
#         flag = True
#         print(flag)
#     else:
#         flag = True
#         print( not flag)
#
# is_negative(number)

# ----------------------------------------------------@Task4----------------------------------------------------
# Напишите функцию is_positive, которая проверяет, является ли число положительным.
# Функция должна возвращать bool.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# number = int(input("Is positive? --->>>"))
# def is_positive(number):
#     if number > 0:
#         flag = True
#         print(flag)
#     else:
#         flag = True
#         print( not flag)
#
# is_positive(number)

# ----------------------------------------------------@Task5----------------------------------------------------
# Напишите функцию make_absolute, которая возвращает модуль числа.
# 	Примечание: Модуль числа это 	|-a| = a;
# 					|a| = a;
# 					|-3| = 3;
# 					|5| = 5;
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# number = int(input("Write the number --->>>"))
# def make_absolute(number):
#     if number < 0:
#         print(number*(-1))
#     else:
#         print(number)
#
# make_absolute(number)

# ----------------------------------------------------@Task6----------------------------------------------------
# Напишите простой калькулятор через функцию calculate, которая имеет 3 параметра:
# 	1. Первое число
# 	2. Операцию в виде символа (+, -, /, *)
# 	3. Второе число
# В завимости от выбранной операции (например, сложение),
# функция производит нужные вычисления и возвращает результат.
# Если операция была передана неверно, то верните как результат None.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# try:
#     first_number = int(input("Write the first number --->>>"))
#     simvol = input("Write the simvol --->>>")
#     second_number = int(input("Write the second number --->>>"))
#
#     def calculate(first_number,simvol,second_number):
#         if simvol == '+':
#             return first_number + second_number
#             # print(f"{first_number + second_number}")
#         elif simvol == '-':
#             return first_number - second_number
#             # print(f"{first_number - second_number}")
#         elif simvol == '*':
#             return first_number * second_number
#             # print(f"{first_number * second_number}")
#         elif simvol == '/':
#             return first_number / second_number
#             # print(f"{first_number / second_number}")
#
#     res = calculate(first_number, simvol, second_number)
#     print(res)
# except ValueError as massege:
#     print("None!",massege)
# except ZeroDivisionError as massege:
#     print("None!",massege)

# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# ______________________________________________Deadline_18/01/2021________________________________________________
# ----------------------------------------------------@Task1----------------------------------------------------
# Напишите функцию mult_range, которая принимает начало (A) и конец (B) диапазона,
# и возвращает произведение чисел в диапазоне (от A до B включительно).
# Если A > B, т.е начало и конец перепутаны, то в таком случае
# их нужно поменять местами и всё равно вернуть результат.
#
# ! Например: mult_range(1, 10) -> 3628800
# ! Например: mult_range(10, 5) -> 151200
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# A = int(input("Start diapsson --->>>"))
# B = int(input("End diapsson --->>>"))
# s = 0
# def mult_range(A,B):
#     j = 1
#     for i in range(A,B+1):
#         j *= i
#     print(j)
# mult_range(A,B)

# ----------------------------------------------------@Task2----------------------------------------------------
# Напишите функцию sum_range, которая принимает начало (A) и конец (B) диапазона,
# и возвращает сумму чисел в диапазоне (от A до B включительно).
# Если A > B, т.е начало и конец перепутаны, то в таком
# случае их нужно поменять местами и всё равно вернуть результат.
#
# ! Например: sum_range(1, 10) -> 55
# ! Например: sum_range(10, 5) -> 45
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# A = int(input("Start diapsson --->>>"))
# B = int(input("End diapsson --->>>"))
# def sum_range(A,B):
#     j = 0
#     if A < B:
#         for i in range(A, B + 1):
#             j += i
#     elif A > B:
#         for i in range(B, A+ 1):
#             j += i
#     print(j)
# sum_range(A,B)

# ----------------------------------------------------@Task3----------------------------------------------------
# Напишите функцию number_len, которая принимает число и возвращает кол-во цифр в нём.
#
# ! Например: number_len(1923) -> 4
# ! Например: number_len(10223) -> 5
# ! Напримеp: number_len(12) -> 2
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# a = str(input("Print number --->>>"))
# def number_len(a):
#     print(len(a))
# number_len(a)

# ----------------------------------------------------@Task3*----------------------------------------------------
# Решите данную задачу без преобразований.
# ________________________________________________РЕШЕНИЕ:::::::::::::::::::::::::::::::::::::::::::::::::::
# NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED
# NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED
# NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED - NOT SOLVED
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
#
#
#
#
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
a = input()
print(type(a))

